InformationRegisters/сабХронометраж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>сабХронометраж</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникОбращения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделПрограммы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаРабот</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияРабот</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОкончанияРабот</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнициаторРабот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Завершено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.БП_Поручение</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаАвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_Бюджет</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаСогласованиеДоговора</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_СогласованиеМассиваДокументов</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаОплату</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаКорректировкуБюджета</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_СлужебнаяЗаписка</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаФинансирование</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаКадровоеДвижение</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИзмененияВ1С.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>ИзмененияВ1С</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВстроеноВРабочуюБазу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Изменение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбращениеВТП</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Д_ОбращенияВТехПоддержку</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Релиз</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Подсистема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГУИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержаниеФорматируемыйДокумент</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьФорматируемыйДокумент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/сабХронометраж/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОбъектМетаданныхНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	НовоеПредставление = ОткрытьФормуМодально("РегистрСведений.ИзмененияВ1С.Форма.ФормаНастройки", Новый Структура("ПредставлениеВыбранныхОбъектов", Запись.ОбъектМетаданных));
	
	Если Не НовоеПредставление = Неопределено Тогда
		Запись.ОбъектМетаданных = НовоеПредставление;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.РазделПрограммы.СписокВыбора.Добавить("Общее");
	Для каждого ТекПодсистема Из Метаданные.Подсистемы Цикл
		Элементы.РазделПрограммы.СписокВыбора.Добавить(ТекПодсистема.Синоним);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Запись.ДатаНачалаРабот = Дата('00010101') Тогда
		Запись.ДатаНачалаРабот = ТекущаяДата();	
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Запись.Исполнитель) Тогда
		Запись.Исполнитель = БюджетныйНаСервере.ПолучитьПользователя();
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПредметПриИзменении(Элемент)
	//Если ТипЗнч(Запись.Предмет) = Тип("ДокументСсылка.Д_ОбращенияВТехПоддержку") И ЗначениеЗаполнено(Запись.Предмет) Тогда
	//	РеквизитыОбращения = БюджетныйНаСервере.ВернутьРеквизиты(Запись.Предмет, "Примечания, РазделПрограммы, Проект, ИсточникОбращения, ВидЗаявки, Автор, ОбъектМетаданных, Содержание");
	//	ЗаполнитьЗначенияСвойств(Запись, РеквизитыОбращения);
	//	Запись.ИнициаторРабот = РеквизитыОбращения.Автор;
	//	Запись.Заголовок = РеквизитыОбращения.Примечания;
	//КонецЕсли;
КонецПроцедуры
